Repository: ChristianScheub/Flutter_TowerGame
Catalog: lib/l10n/app_*.arb
Languages: de

source: Game Over
de: Spiel beendet

source: Victory!
de: Sieg!

source: Return to Menu
de: Zurück zum Menü

source: Try Again
de: Erneut versuchen

# continueText
source: Continue
de: Weiter

source: Play Again
de: Nochmal spielen

# pauseTitle
source: Game Paused
de: Spiel pausiert

# pauseContent
source: Take a break or adjust your strategy.
de: Mach eine Pause oder passe deine Strategie an.

source: Resume
de: Fortsetzen

source: Quit
de: Beenden

source: Upgrade Tower
de: Turm verbessern

# currentLevel
source: Current Level: {level}
de: Aktuelles Level: {level}

# upgradeCost
source: Upgrade Cost: {cost}
de: Verbesserungskosten: {cost}

# upgradeWill
source: Upgrading will:
de: Die Verbesserung bewirkt:

# upgradeEffect1
source: • Increase damage by 20%
de: • Schaden um 20 % erhöhen

# upgradeEffect2
source: • Increase range by 10%
de: • Reichweite um 10 % erhöhen

# upgradeEffect3
source: • Increase fire rate by 10%
de: • Feuerrate um 10 % erhöhen

source: Cancel
de: Abbrechen

source: Upgrade
de: Verbessern

# selectLevelTitle
source: Select Level
de: Level wählen

# selectLevelCampaign
source: Campaign
de: Kampagne

# selectLevelSpecial
source: Special
de: Spezial

# selectLevelEndlessTitle
source: ENDLESS
de: ENDLOS

# selectLevelEndlessSubtitle
source: MODE
de: MODUS

# settingsTitle
source: Settings
de: Einstellungen

# aboutSection
source: About
de: Über

source: Why This Game?
de: Warum dieses Spiel?

source: View source code
de: Quellcode ansehen

source: Dependencies
de: Abhängigkeiten

# viewUsedLibraries
source: View used libraries and licenses
de: Verwendete Bibliotheken und Lizenzen anzeigen

source: Imprint
de: Impressum

source: Privacy Policy
de: Datenschutzerklärung

# aboutTitle
source: About This Game
de: Über dieses Spiel

# aboutDescription1
source: This Tower Defense game was created as a passion project because I always wanted to build one! It was developed in just 5 hours using AI as a quick exercise in game / Flutter development with AI.
de: Dieses Tower-Defense-Spiel wurde als Herzensprojekt erstellt, weil ich schon immer eines bauen wollte! Es wurde in nur 5 Stunden mit KI als schnelle Übung in Spiel- und Flutter-Entwicklung mit KI erstellt.

# aboutDescription2
source: The project is completely open source and available on GitHub. Feel free to explore, modify, or contribute to the code!
de: Das Projekt ist vollständig Open Source und auf GitHub verfügbar. Du kannst den Code gerne erkunden, verändern oder beitragen!

source: Close
de: Schließen

source: Play Game
de: Spiel starten

source: About This Game
de: Über dieses Spiel

# aboutThisGameDescription
source: This Tower Defense game was created as a passion project because I always wanted to build one! It was developed in just 5 hours using AI as a quick exercise in game and Flutter development.
de: Dieses Tower-Defense-Spiel wurde als Herzensprojekt erstellt, weil ich schon immer eines bauen wollte! Es wurde in nur 5 Stunden mithilfe von KI als schnelles Übungsprojekt für Spiele- und Flutter-Entwicklung umgesetzt.

# aboutThisGameGithub
source: The project is completely open source and available on GitHub. Feel free to explore, modify, or contribute to the code!
de: Das Projekt ist vollständig Open Source und auf GitHub verfügbar. Du kannst den Code gerne erkunden, anpassen oder verbessern!

# imprintTitle
source: Imprint
de: Impressum

source: Company Information
de: Unternehmensinformationen

source: Legal Information
de: Rechtliche Angaben

source: Disclaimer
de: Haftungsausschluss

# yourImprintTitle
source: Service Provider
de: Herausgeber / Dienstanbieter

# yourImprintContent
source: Publisher according to § 5 TMG: Christian Scheub Ziegeläcker 56 71560 Sulzbach an der Murr Contact: Phone: +49 176 21674883 Email: christian.developer.app@gmail.com
de: Angaben gem. § 5 TMG: Christian Scheub Ziegeläcker 56 71560 Sulzbach an der Murr Kontakt: Telefon: +49 176 21674883 E-Mail: christian.developer.app@gmail.com

# privacyPolicyTitle
source: Data Privacy Policy
de: Datenschutzerklärung

# privacyline1
source: <strong>This privacy policy is available in English and other languages.</strong>
de: <strong>Diese Datenschutzerklärung ist in Englisch und anderen Sprachen verfügbar.</strong>

# privacyline2
source: <strong>To switch languages, simply change your device language setting.</strong><br /><br />
de: <strong>Für eine andere Sprache verstellen Sie bitte einfach die Sprache Ihres Gerätes.</strong><br /><br />

# privacyline3
source: <strong>Privacy Policy for Website/App</strong><br /><br />
de: <strong>Datenschutzerklärung für Webseite/App</strong><br /><br />

# privacyline4
source: Thank you for using our website/app. We value your privacy. This app works entirely offline and does not transmit any data to servers or third parties.<br /><br />
de: Vielen Dank für Ihren Besuch auf unserer Webseite/App. Wir legen großen Wert auf den Schutz Ihrer Daten. Diese App funktioniert vollständig offline und überträgt keinerlei Daten an Server oder Dritte.<br /><br />

# privacyline5
source: <strong>1. Responsible Entity</strong><br />
de: <strong>1. Verantwortliche Stelle</strong><br />

# privacyline6
source: The person responsible for data processing is:<br />
de: Verantwortlich für die Datenverarbeitung ist:<br />

# privacyline10
source: Phone: +49 176 21674883<br />
de: Telefon: +49 176 21674883<br />

# privacyline12
source: Owner/Operator: Christian Scheub<br />
de: Geschäftsführer/Inhaber: Christian Scheub<br />

# privacyline13
source: Link to legal notice: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint<br /><br />
de: Link zum Impressum: https://kind-dune-0dfff9903.4.azurestaticapps.net/imprint<br /><br />

# privacyline14
source: <strong>2. Local Data Storage</strong><br />
de: <strong>2. Lokale Datenspeicherung</strong><br />

# privacyline15
source: This app stores all data locally on your device using technologies such as Local Storage or IndexedDB. No data is transmitted to any server or third party.<br />
de: Diese App speichert Daten ausschließlich lokal auf Ihrem Gerät – z. B. über Local Storage oder IndexedDB. Es erfolgt keine Übertragung an Server oder Dritte.<br />

# privacyline16
source: All data, such as tasks, settings, or notes, remain solely on your device.<br /><br />
de: Ihre Daten verbleiben vollständig auf Ihrem Gerät. Das gilt auch für alle Inhalte wie Aufgaben, Einstellungen oder Notizen.<br /><br />

# privacyline17
source: <strong>3. No Tracking or Analytics</strong><br />
de: <strong>3. Keine Analyse- oder Tracking-Tools</strong><br />

# privacyline18
source: This app does not use cookies, trackers, ad IDs, or any external analytics or tracking services.<br /><br />
de: Es werden keine Cookies, keine Tracker, keine Werbe-IDs und keine externen Analyse- oder Trackingdienste verwendet.<br /><br />

# privacyline19
source: <strong>4. Your Rights</strong><br />
de: <strong>4. Ihre Rechte</strong><br />

# privacyline20
source: Since no personal data is processed or stored, legal rights like access or deletion do not apply. You can delete local data at any time via the app or your device settings.<br /><br />
de: Da keine personenbezogenen Daten verarbeitet oder gespeichert werden, entfallen gesetzliche Rechte wie Auskunft oder Löschung. Sie können lokal gespeicherte Daten jederzeit in der App oder über die Geräteeinstellungen löschen.<br /><br />

# privacyline21
source: <strong>5. Data Security</strong><br />
de: <strong>5. Datensicherheit</strong><br />

# privacyline22
source: Your data is stored only on your device. Please protect your device using system security measures. The app itself does not transfer data.<br /><br />
de: Ihre Daten sind nur lokal gespeichert. Bitte schützen Sie Ihr Gerät z. B. durch Gerätesperre oder Verschlüsselung. Die App selbst überträgt keine Daten.<br /><br />

# privacyline23
source: <strong>6. Changes to This Privacy Policy</strong><br />
de: <strong>6. Änderungen dieser Datenschutzerklärung</strong><br />

# privacyline24
source: This privacy policy may be updated due to technical or legal changes. Please check regularly for updates.<br />
de: Diese Datenschutzerklärung kann bei technischen oder rechtlichen Änderungen angepasst werden. Bitte prüfen Sie regelmäßig den aktuellen Stand.<br />

# privacyline25
source: Date: 2025-05-06<br /><br />
de: Datum: 06.05.2025<br /><br />
